html/erlang/tutorial/sequential/map.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>映射</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="list.html"> UP </a>
 |
 <a accesskey="H" href="sequential.html"> HOME </a>
</div><div id="content">
<h1 class="title">映射</h1>
<p>
映射用于表示 <span class="underline">键</span> 和 <span class="underline">值</span> 的 <b>关联</b> 关系。这种关联方式是由 <span class="underline">#{</span> 与 <span class="underline">}</span> 括起来。创建一个字符串 "key" 到值 42 的映射的方法如下： 
</p>

<div class="org-src-container">
<pre class="src src-sh">1&gt;<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">{ "key" =&gt; 42}.</span>
  <span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">{"key" =&gt; 42}</span>
</pre>
</div>

<p>
下面的例子展示了使用映射来关联颜色与 alpha 通道，从而计算 alpha 混合的方法：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-module</span>(color).

<span style="color: #ffd700;">-export</span>([<span style="color: #98f5ff;">new/4</span>, <span style="color: #98f5ff;">blend/2</span>]).

<span style="color: #ffd700;">-define</span>(<span style="color: #98f5ff;">is_channel</span>(<span style="color: #4eee94;">V</span>), (<span style="color: #f08080;">is_float</span>(<span style="color: #4eee94;">V</span>) <span style="color: #f08080;">andalso</span> <span style="color: #4eee94;">V</span> &gt;= 0.0 <span style="color: #f08080;">andalso</span> <span style="color: #4eee94;">V</span> =&lt; 1.0)).

<span style="color: #daa520; font-weight: bold;">new</span>(<span style="color: #4eee94;">R</span>,<span style="color: #4eee94;">G</span>,<span style="color: #4eee94;">B</span>,<span style="color: #4eee94;">A</span>) <span style="color: #00bfff; font-weight: bold;">when</span> ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">R</span>), ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">G</span>),
                  ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">B</span>), ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">A</span>) -&gt;
    #{red =&gt; <span style="color: #4eee94;">R</span>, green =&gt; <span style="color: #4eee94;">G</span>, blue =&gt; <span style="color: #4eee94;">B</span>, alpha =&gt; <span style="color: #4eee94;">A</span>}.

<span style="color: #daa520; font-weight: bold;">blend</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) -&gt;
    <span style="color: #98f5ff;">blend</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>,<span style="color: #98f5ff;">alpha</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>)).

<span style="color: #daa520; font-weight: bold;">blend</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>,<span style="color: #4eee94;">Alpha</span>) <span style="color: #00bfff; font-weight: bold;">when</span> <span style="color: #4eee94;">Alpha</span> &gt; 0.0 -&gt;
    <span style="color: #4eee94;">Dst</span>#{
         red   := <span style="color: #98f5ff;">red</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) / <span style="color: #4eee94;">Alpha</span>,
         green := <span style="color: #98f5ff;">green</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) / <span style="color: #4eee94;">Alpha</span>,
         blue  := <span style="color: #98f5ff;">blue</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) / <span style="color: #4eee94;">Alpha</span>,
         alpha := <span style="color: #4eee94;">Alpha</span>
        };
<span style="color: #daa520; font-weight: bold;">blend</span>(<span style="color: #4eee94;">_</span>,<span style="color: #4eee94;">Dst</span>,<span style="color: #4eee94;">_</span>) -&gt;
    <span style="color: #4eee94;">Dst</span>#{
         red   := 0.0,
         green := 0.0,
         blue  := 0.0,
         alpha := 0.0
        }.

<span style="color: #daa520; font-weight: bold;">alpha</span>(#{alpha := <span style="color: #4eee94;">SA</span>}, #{alpha := <span style="color: #4eee94;">DA</span>}) -&gt;
    <span style="color: #4eee94;">SA</span> + <span style="color: #4eee94;">DA</span>*(1.0 - <span style="color: #4eee94;">SA</span>).

<span style="color: #daa520; font-weight: bold;">red</span>(#{red := <span style="color: #4eee94;">SV</span>, alpha := <span style="color: #4eee94;">SA</span>}, #{red := <span style="color: #4eee94;">DV</span>, alpha := <span style="color: #4eee94;">DA</span>}) -&gt;
    <span style="color: #4eee94;">SV</span>*<span style="color: #4eee94;">SA</span> + <span style="color: #4eee94;">DV</span>*<span style="color: #4eee94;">DA</span>*(1.0 - <span style="color: #4eee94;">SA</span>).
<span style="color: #daa520; font-weight: bold;">green</span>(#{green := <span style="color: #4eee94;">SV</span>, alpha := <span style="color: #4eee94;">SA</span>}, #{green := <span style="color: #4eee94;">DV</span>, alpha := <span style="color: #4eee94;">DA</span>}) -&gt;
    <span style="color: #4eee94;">SV</span>*<span style="color: #4eee94;">SA</span> + <span style="color: #4eee94;">DV</span>*<span style="color: #4eee94;">DA</span>*(1.0 - <span style="color: #4eee94;">SA</span>).
<span style="color: #daa520; font-weight: bold;">blue</span>(#{blue := <span style="color: #4eee94;">SV</span>, alpha := <span style="color: #4eee94;">SA</span>}, #{blue := <span style="color: #4eee94;">DV</span>, alpha := <span style="color: #4eee94;">DA</span>}) -&gt;
    <span style="color: #4eee94;">SV</span>*<span style="color: #4eee94;">SA</span> + <span style="color: #4eee94;">DV</span>*<span style="color: #4eee94;">DA</span>*(1.0 - <span style="color: #4eee94;">SA</span>).
</pre>
</div>

<p>
首先定义了一个宏 is_channel，这个宏用的作用主要是方便检查
</p>
<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #ffd700;">-define</span>(<span style="color: #98f5ff;">is_channel</span>(<span style="color: #4eee94;">V</span>), (<span style="color: #f08080;">is_float</span>(<span style="color: #4eee94;">V</span>) <span style="color: #f08080;">andalso</span> <span style="color: #4eee94;">V</span> &gt;= 0.0 <span style="color: #f08080;">andalso</span> <span style="color: #4eee94;">V</span> =&lt; 1.0)).
</pre>
</div>

<pre class="example">
大多数情况下，使用宏目的都是为了方便使用或者简化语法
</pre>


<p>
函数 new/4 <b>创建</b> 了一个新的 <span class="underline">映射</span> ，此映射将 red，green，blue 以及 alpha 这些健与初始值关联起来，注意，在创建新映射的时候只能使用 <span class="underline">=&gt;</span> 运算符
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">new</span>(<span style="color: #4eee94;">R</span>,<span style="color: #4eee94;">G</span>,<span style="color: #4eee94;">B</span>,<span style="color: #4eee94;">A</span>) <span style="color: #00bfff; font-weight: bold;">when</span> ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">R</span>), ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">G</span>),
                  ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">B</span>), ?<span style="color: #ffd700;">is_channel</span>(<span style="color: #4eee94;">A</span>) -&gt;
    #{red =&gt; <span style="color: #4eee94;">R</span>, green =&gt; <span style="color: #4eee94;">G</span>, blue =&gt; <span style="color: #4eee94;">B</span>, alpha =&gt; <span style="color: #4eee94;">A</span>}.
</pre>
</div>

<pre class="example">
is_channel 保证了只有 0.0 与 1.0 之间的浮点数是合法数值 （其中包括 0.0 与 1.0 两个端点值） 
</pre>

<p>
使用由 new/4 函数生成的任何颜色作为参数调用函数 blend/2，就可以得到该颜色的 alpha 混合结果。显然，这个结果是由两个映射来决定的。blend/2 函数所做的第一件事就是计算 alpha 通道：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">alpha</span>(#{alpha := <span style="color: #4eee94;">SA</span>}, #{alpha := <span style="color: #4eee94;">DA</span>}) -&gt;
    <span style="color: #4eee94;">SA</span> + <span style="color: #4eee94;">DA</span>*(1.0 - <span style="color: #4eee94;">SA</span>).
</pre>
</div>

<p>
使用 <span class="underline">:=</span> 操作符 <b>取得</b> 键 alpha 相关联的值作为参数的值
</p>

<pre class="example">
映射中的其它键被直接忽略 (red, green, blue 键) ，因为只需要键 alpha 与其值，所以也只会检查映射中的该键值对
</pre>

<p>
对于函数 red/2，blue/2 和 green/2 也是一样的：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">red</span>(#{red := <span style="color: #4eee94;">SV</span>, alpha := <span style="color: #4eee94;">SA</span>}, #{red := <span style="color: #4eee94;">DV</span>, alpha := <span style="color: #4eee94;">DA</span>}) -&gt;
    <span style="color: #4eee94;">SV</span>*<span style="color: #4eee94;">SA</span> + <span style="color: #4eee94;">DV</span>*<span style="color: #4eee94;">DA</span>*(1.0 - <span style="color: #4eee94;">SA</span>).
</pre>
</div>

<pre class="example">
唯一不同的是，每个映射参数中都有两个键会被检查，而其它键会被忽略 
</pre>

<p>
最后，回到 blend/3 返回的颜色：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #daa520; font-weight: bold;">blend</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>,<span style="color: #4eee94;">Alpha</span>) <span style="color: #00bfff; font-weight: bold;">when</span> <span style="color: #4eee94;">Alpha</span> &gt; 0.0 -&gt;
    <span style="color: #4eee94;">Dst</span>#{
         red   := <span style="color: #98f5ff;">red</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) / <span style="color: #4eee94;">Alpha</span>,
         green := <span style="color: #98f5ff;">green</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) / <span style="color: #4eee94;">Alpha</span>,
         blue  := <span style="color: #98f5ff;">blue</span>(<span style="color: #4eee94;">Src</span>,<span style="color: #4eee94;">Dst</span>) / <span style="color: #4eee94;">Alpha</span>,
         alpha := <span style="color: #4eee94;">Alpha</span>
        };
</pre>
</div>

<pre class="example">
Dst 映射会被更新为一个新的通道值
</pre>

<p>
<b>更新</b> 已存在的 <span class="underline">映射键值对</span> 可以用 <span class="underline">:=</span> 操作符 
</p>

<p>
最后测试下：
</p>

<div class="org-src-container">
<pre class="src src-sh">18&gt; C1 = color:new(0.3,0.4,0.5,1.0)<span style="color: #f08080;">.</span> 
C1 = color:new(0.3,0.4,0.5,1.0)<span style="color: #f08080;">.</span> 
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">{alpha =&gt; 1.0,blue =&gt; 0.5,green =&gt; 0.4,red =&gt; 0.3}</span>

19&gt; C2 = color:new(1.0,0.8,0.1,0.3)<span style="color: #f08080;">.</span> 
C2 = color:new(1.0,0.8,0.1,0.3)<span style="color: #f08080;">.</span> 
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">{alpha =&gt; 0.3,blue =&gt; 0.1,green =&gt; 0.8,red =&gt; 1.0}</span>

20&gt; color:blend(C1,C2)<span style="color: #f08080;">.</span>
color:blend(C1,C2)<span style="color: #f08080;">.</span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">{alpha =&gt; 1.0,blue =&gt; 0.5,green =&gt; 0.4,red =&gt; 0.3}</span>

21&gt; color:blend(C2,C1)<span style="color: #f08080;">.</span>
color:blend(C2,C1)<span style="color: #f08080;">.</span>
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">{alpha =&gt; 1.0,blue =&gt; 0.38,green =&gt; 0.52,red =&gt; 0.51}</span>
</pre>
</div>

<p>
<a href="man.html">Next：使用手册</a>
</p>

<p>
<a href="list.html">Previous：列表</a> 
</p>

<p>
<a href="sequential.html">Home：顺序编程</a>
</p>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
